zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100sp256kb_64_tqfp_mc.h
    /* P4.7 */
    P4_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_7_CSD_SENSE                  =  4,       /* csd.sense:51 */
    P4_7_CSD_SHIELD                 =  5,       /* csd.shield:51 */
    P4_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_7_TCPWM_LINE_COMPL6          =  8,       /* Digital Active - tcpwm.line_compl[6]:0 */
    P4_7_SCB4_UART_RTS              =  9,       /* Digital Active - scb[4].uart_rts */
    P4_7_LCD_COM39                  = 12,       /* Digital Deep Sleep - lcd.com[39] */
    P4_7_LCD_SEG39                  = 13,       /* Digital Deep Sleep - lcd.seg[39] */
    P4_7_SCB4_SPI_SELECT0           = 14,       /* Digital Deep Sleep - scb[4].spi_select0 */
    P4_7_SCB3_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[3].spi_select2:0 */

    /* P5.0 */
    P5_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_0_CSD_SENSE                  =  4,       /* csd.sense:8 */
    P5_0_CSD_SHIELD                 =  5,       /* csd.shield:8 */
    P5_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_0_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:2 */
    P5_0_PASS1_DSI_CTB_CMP0         = 10,       /* Digital Active - pass[1].dsi_ctb_cmp0:0 */
    P5_0_SCB2_UART_RX               = 11,       /* Digital Active - scb[2].uart_rx:1 */
    P5_0_LCD_COM40                  = 12,       /* Digital Deep Sleep - lcd.com[40] */
    P5_0_LCD_SEG40                  = 13,       /* Digital Deep Sleep - lcd.seg[40] */
    P5_0_SCB2_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[2].i2c_scl:1 */
    P5_0_SCB2_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[2].spi_mosi:0 */

    /* P5.1 */
    P5_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_1_CSD_SENSE                  =  4,       /* csd.sense:9 */
    P5_1_CSD_SHIELD                 =  5,       /* csd.shield:9 */
    P5_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_1_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:2 */
    P5_1_PASS1_DSI_CTB_CMP1         = 10,       /* Digital Active - pass[1].dsi_ctb_cmp1:0 */
    P5_1_SCB2_UART_TX               = 11,       /* Digital Active - scb[2].uart_tx:2 */
    P5_1_LCD_COM41                  = 12,       /* Digital Deep Sleep - lcd.com[41] */
    P5_1_LCD_SEG41                  = 13,       /* Digital Deep Sleep - lcd.seg[41] */
    P5_1_SCB2_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[2].i2c_sda:1 */
    P5_1_SCB2_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[2].spi_miso:0 */

    /* P5.2 */
    P5_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_2_CSD_SENSE                  =  4,       /* csd.sense:10 */
    P5_2_CSD_SHIELD                 =  5,       /* csd.shield:10 */
    P5_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_2_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:2 */
    P5_2_SCB2_UART_CTS              = 11,       /* Digital Active - scb[2].uart_cts:1 */
    P5_2_LCD_COM42                  = 12,       /* Digital Deep Sleep - lcd.com[42] */
    P5_2_LCD_SEG42                  = 13,       /* Digital Deep Sleep - lcd.seg[42] */
    P5_2_LPCOMP_COMP0               = 14,       /* Digital Deep Sleep - lpcomp.comp[0]:2 */
    P5_2_SCB2_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[2].spi_clk:0 */

    /* P5.3 */
    P5_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_3_CSD_SENSE                  =  4,       /* csd.sense:11 */
    P5_3_CSD_SHIELD                 =  5,       /* csd.shield:11 */
    P5_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_3_TCPWM_LINE_COMPL5          =  8,       /* Digital Active - tcpwm.line_compl[5]:2 */
    P5_3_SCB2_UART_RTS              = 11,       /* Digital Active - scb[2].uart_rts:1 */
    P5_3_LCD_COM43                  = 12,       /* Digital Deep Sleep - lcd.com[43] */
    P5_3_LCD_SEG43                  = 13,       /* Digital Deep Sleep - lcd.seg[43] */
    P5_3_LPCOMP_COMP1               = 14,       /* Digital Deep Sleep - lpcomp.comp[1]:0 */
    P5_3_SCB2_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[2].spi_select0:0 */

    /* P5.5 */
    P5_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_5_CSD_SENSE                  =  4,       /* csd.sense:13 */
    P5_5_CSD_SHIELD                 =  5,       /* csd.shield:13 */
    P5_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_5_TCPWM_LINE_COMPL6          =  8,       /* Digital Active - tcpwm.line_compl[6]:2 */
    P5_5_LCD_COM45                  = 12,       /* Digital Deep Sleep - lcd.com[45] */
    P5_5_LCD_SEG45                  = 13,       /* Digital Deep Sleep - lcd.seg[45] */
    P5_5_SCB2_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[2].spi_select2:0 */

    /* P5.6 */
    P5_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_6_CSD_SENSE                  =  4,       /* csd.sense:52 */
    P5_6_CSD_SHIELD                 =  5,       /* csd.shield:52 */
    P5_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_6_TCPWM_LINE7                =  8,       /* Digital Active - tcpwm.line[7]:0 */
    P5_6_LCD_COM46                  = 12,       /* Digital Deep Sleep - lcd.com[46] */
    P5_6_LCD_SEG46                  = 13,       /* Digital Deep Sleep - lcd.seg[46] */
    P5_6_SCB4_SPI_SELECT1           = 14,       /* Digital Deep Sleep - scb[4].spi_select1 */
    P5_6_SCB2_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[2].spi_select3:0 */

    /* P5.7 */
    P5_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P5_7_CSD_SENSE                  =  4,       /* csd.sense:53 */
    P5_7_CSD_SHIELD                 =  5,       /* csd.shield:53 */
    P5_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P5_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P5_7_TCPWM_LINE_COMPL7          =  8,       /* Digital Active - tcpwm.line_compl[7]:0 */
    P5_7_LCD_COM47                  = 12,       /* Digital Deep Sleep - lcd.com[47] */
    P5_7_LCD_SEG47                  = 13,       /* Digital Deep Sleep - lcd.seg[47] */
    P5_7_SCB4_SPI_SELECT2           = 14,       /* Digital Deep Sleep - scb[4].spi_select2 */
    P5_7_SCB3_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[3].spi_select1:0 */

    /* P6.1 */
    P6_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_1_CSD_SENSE                  =  4,       /* csd.sense:31 */
    P6_1_CSD_SHIELD                 =  5,       /* csd.shield:31 */
    P6_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_1_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:1 */
    P6_1_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:0 */
    P6_1_LCD_COM49                  = 12,       /* Digital Deep Sleep - lcd.com[49] */
    P6_1_LCD_SEG49                  = 13,       /* Digital Deep Sleep - lcd.seg[49] */
    P6_1_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:1 */
    P6_1_SCB3_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[3].spi_miso:0 */

    /* P6.2 */
    P6_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_2_CSD_SENSE                  =  4,       /* csd.sense:32 */
    P6_2_CSD_SHIELD                 =  5,       /* csd.shield:32 */
    P6_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_2_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:0 */
    P6_2_SCB3_UART_CTS              =  9,       /* Digital Active - scb[3].uart_cts:0 */
    P6_2_LCD_COM50                  = 12,       /* Digital Deep Sleep - lcd.com[50] */
    P6_2_LCD_SEG50                  = 13,       /* Digital Deep Sleep - lcd.seg[50] */
    P6_2_SCB3_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[3].spi_clk:0 */

    /* P6.4 */
    P6_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_4_CSD_SENSE                  =  4,       /* csd.sense:34 */
    P6_4_CSD_SHIELD                 =  5,       /* csd.shield:34 */
    P6_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_4_TCPWM_LINE6                =  8,       /* Digital Active - tcpwm.line[6]:3 */
    P6_4_LCD_COM52                  = 12,       /* Digital Deep Sleep - lcd.com[52] */
    P6_4_LCD_SEG52                  = 13,       /* Digital Deep Sleep - lcd.seg[52] */
    P6_4_SCB4_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[4].i2c_scl */
    P6_4_SCB3_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[3].spi_select1:1 */

